// Задачи к уроку 1. Первая очень часто мелькает на собеседованиях🙂
// Вторая для проработки алгоритмов

// 1) Сделать цикл и вывести числа от 0 до 100 включительно в console.log

// • Если число делится на 3 то рядом с числом вывести строку  «Fizz».
// • Если число делится на 5, то рядом с числом вывести строку  «Buzz».
// • Если число делится одновременно на 3 и на 5, то рядом вывести «FizzBuzz».
//
// 2) Дан массив чисел
//
// let nums = [4, 5, 1, 2, -10, 100, 5];
//
// Написать функцию, которая возвращает массив с минимальным и максимальным числами из этого массива.
//   То есть на выходе будет [ -10, 100]

// Решение 2 задачи:
let nums = [4, 5, 1, 2, -10, 100, 5];

function findItems(array) {
  
}
