// написать функцию, либо последовательность опареций, которая вернет результат следующих условий
// результат есть строка из скокатенированных "value" элементов коллекции, расположенных в обратном порядке символов,
// результат сохраняется только из непосредственных записей и конкатенируется в порядке возрастания "order"
// результат не содержит одинаковых символов

const input = [
  { value: 'bcd', order: 4, expired: false },
  { value: 'bca', order: 2, expired: true },
  { value: 'xyz1', order: 3, expired: false },
  { value: 'xyz2', order: 3, expired: false },
];

