const remapData = (dataArray) => {
  return dataArray.reduce((acc, currentArr) => {
    const [product, ...people] = currentArr; // Первый элемент — товар, остальные — люди

    people.forEach(person => {
      if (!acc[person]) {
        acc[person] = []; // Если человека нет в объекте, создаем массив
      }
      acc[person].push(product); // Добавляем товар в массив
    });

    return acc;
  }, {});
};

// У вас есть массив массивов dataArray.
// Каждый вложенный массив описывает товар и людей, связанных с этим товаром:
// Первый элемент — это название товара.
// Остальные элементы — это имена людей, которые связаны с этим товаром.
console.log(
  remapData([
    ['Помидоры', 'Аня', 'Женя'], // {} item
    ['Огурцы', 'Женя', 'Аня'], // item
    ['Рис', 'Аня', 'Саша'], // item
    ['Лосось', 'Иван'], // item
  ])
);
// Что нужно получить:
// Необходимо создать объект: { }, где:
// Ключами будут имена людей (например, 'Аня', 'Женя', 'Иван').
// Значениями для каждого ключа будет массив товаров, связанных с этим человеком.
// Пример результата (Преобразовать массив - в обьект совпадении персон с товарами):

// {
//   'Аня': ['Помидоры', 'Огурцы', 'Рис'],
//   'Женя': ['Помидоры', 'Огурцы'],
//   'Иван': ['Лосось'],
//   'Саша': ['Рис']
// }
// ====================================================================================================================================
// Задача: 2
// У вас есть массив пользователей.Нужно преобразовать его в объект,
// где ключами будут ID пользователей, а значениями — их данные.

const users = [
  { id: 1, name: 'Аня', age: 25 },
  { id: 2, name: 'Женя', age: 30 },
  { id: 3, name: 'Саша', age: 28 },
];

// Результат:
// {
// 1: { id: 1, name: 'Аня', age: 25 },
// 2: { id: 2, name: 'Женя', age: 30 },
// 3: { id: 3, name: 'Саша', age: 28 }
// }

// Решение:
// 1 способ:
const changer = (objArray) => {
  return objArray.reduce((acc, currObj) => {
    if (!acc[currObj.id]) {
      acc[currObj.id] = {}
    }

    acc[currObj.id] = { id: currObj.id, name: currObj.name, age: currObj.age }

    return acc
  }, {}) // const acc = {} end: const acc = { 1: { id: 1, name: 'Аня', age: 25 }, }
}

console.log(changer(users))

// 2 способ: через деструктуризацию

// ====================================================================================================================================
// Задача: 3















// ====================================================================================================================================
// Задача: 4
























// ====================================================================================================================================
// Задача: 5





















// ====================================================================================================================================
// Задача: 6




































